public class Main {
    public static void main(String[] args) {

        /*
            Создайте класс Phone, который содержит переменные number, brand и model.
            Создайте три экземпляра этого класса.
                Выведите на консоль значения их переменных методом toString.
                Добавить в класс Phone метод:receiveCall, имеет один параметр –имя звонящего.
            Выводит на консоль сообщение “Звонит name”.
            Задайте метод getNumber –возвращает номер телефона.
                Вызвать этот метод для каждого из объектов.
            Добавить конструктор в класс Phone, который принимает на вход три параметра
            для инициализации переменных класса -number, brand и model.
            Добавить в класс setter и getter.*/

       /*Phone myPhone=new Phone();

        myPhone.phoneNumber="+498435245";
        myPhone.brand="Samsung";
        myPhone.model="A-52";

        Phone myPhone1=new Phone();

        myPhone1.phoneNumber="+380660101026";
        myPhone1.brand="Samsung";
        myPhone1.model="A-52A";

        Phone myPhone2=new Phone();

        myPhone2.phoneNumber="++380660101025";
        myPhone2.brand="Samsung";
        myPhone2.model="A-52A";

        myPhone.toString();
        myPhone1.toString();
        myPhone2.toString();

        myPhone.recievCall("Mama");
        myPhone1.recievCall("Papa");

        System.out.println(myPhone1.getPhoneNumber());*/




    }
}